"""
Задача:

Напишите программу "Автодилер", в окно которой пользователь сможет ввести стоимость автомобиля 
без наценок. Программа должна прибавлять к ней несколько дополнительных сумм: налог, регистрационный 
сбор, агентский сбор, цену доставки машины по месту назначения. Пусть налог и регистрационный сбор 
вычисляются как доля от начальной стоимости, а остальные наценки будем считать фиксированными 
величинами. Окончательная цена автомобиля должна быть выведена на экран.
"""

sum = int(input())
nalog = sum * 0.13
r_sbor = sum * 0.05
print(sum + nalog + r_sbor + 3000 + 7000)