"""
Задача:

Напишите программу, в окно которой пользователь сможет ввести названия двух своих любимых блюд. 
Программа должна сцеплять эти две строки и выводить полученную строку как название нового невиданного 
блюда.
"""

first_food = input()
second_food = input()
print(first_food + second_food)