"""
Задача:

Напишите программу "щедрый посетитель", в окно которой пользователь 
сможет ввести сумму счета за обед в ресторане. Программа должна выводить 
два значения: чаевые из расчета 15 и 20 % от указанной суммы.
"""

sum = int(input())
print(sum * 0.15, ' ', sum * 0.20)