"""
Задача:

Научитесь вызывать ошибку: в интерактивном режиме введите название своего любимого 
сорта мороженого. Потом исправьте ошибку и создайте команду, которая будет правильным 
образом выводить на экран название сорта.
"""

"""
Код с ошибкой:

printt(input())
"""
# При запуске программы получаем ошибку: "printt" is not defined

# Рабочий код: 

print(input())

