"""
Задача:

Напишите и сохраните программу, которая будет выводить ваше имя и 
дожидаться, пока пользователь нажмет Enter для выхода. Запустите 
эту программу, дважды щелкнув на ее значке.
"""

print(input())
input('Нажмите Enter')