"""
Задача:

Напишите программу, которая будет выводить на экран ваш любимый афоризм. 
Не забудьте о том, что автор афоризма должен быть упомянут на отдельной 
строке.
"""

print(input(), '\n', input())